eisup_2019_docmng_integration/src/InformationRegisters/абс_СкладыВПутиОрганизаций/абс_СкладыВПутиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СкладыВПутиОрганизаций</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СкладыВПутиОрганизаций/ManagerModule.bsl
Функция ПолучитьСкладВПути(Организация) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_СкладыВПутиОрганизаций.Склад
	|ИЗ
	|	РегистрСведений.абс_СкладыВПутиОрганизаций КАК абс_СкладыВПутиОрганизаций
	|ГДЕ
	|	абс_СкладыВПутиОрганизаций.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Склад;	
	КонецЕсли;

КонецФункции
